In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("ejemplo1.csv")
print(df)

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    27    Sevilla

In [13]:
print(df.shape)
type(df)

(3, 3)

pandas.core.frame.DataFrame

In [7]:
df.head()

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    27    Sevilla

In [27]:
df.index = ['a', 'b','c']
df

  nombre  edad     ciudad
a   Juan    25     Madrid
b  María    30  Barcelona
c  Pedro    27    Sevilla

In [11]:
#acceder a datos por sus Columnas
df["nombre"]
#df.nombre

0     Juan
1    María
2    Pedro
Name: nombre, dtype: object

In [14]:
#indexado por filas
#serie con los datos de la fila 1
#acceso por indice numerico
df.iloc[1]

nombre        María
edad             30
ciudad    Barcelona
Name: 1, dtype: object

In [15]:
#acceso por etiqueta de índice, si se ha asignado una etiqueta personalizada a las filas
df.loc[1]

nombre        María
edad             30
ciudad    Barcelona
Name: 1, dtype: object

In [16]:
#ejemplo2 etiqueta fecha como indice
df_1 = pd.read_csv("ejemplo2.csv", index_col="fecha")
df_1

           nombre  edad     ciudad
fecha
01/01/2023   Juan    25     Madrid
02/01/2023  María    30  Barcelona
03/01/2023  Pedro    27    Sevilla

In [18]:
df_1.loc["03/01/2023"]

nombre      Pedro
edad           27
ciudad    Sevilla
Name: 03/01/2023, dtype: object

In [19]:
df_1.loc["02/01/2023":"03/01/2023"]

           nombre  edad     ciudad
fecha
02/01/2023  María    30  Barcelona
03/01/2023  Pedro    27    Sevilla

In [22]:
#Indexado combinado
print(df_1.loc["02/01/2023":"03/01/2023","edad"])
df_1.loc["02/01/2023":"03/01/2023","edad":"ciudad"]

fecha
02/01/2023    30
03/01/2023    27
Name: edad, dtype: int64

            edad     ciudad
fecha
02/01/2023    30  Barcelona
03/01/2023    27    Sevilla

In [25]:
df_1.iloc[1:3]
print(df_1.iloc[1:3, 1])

fecha
02/01/2023    30
03/01/2023    27
Name: edad, dtype: int64

In [29]:
#select * from tabla where edad > 27
df[df["edad"]>27]

  nombre  edad     ciudad
b  María    30  Barcelona

In [30]:
df.query("edad > 27")
df.query('Carrera == "Mat"')
df_1[df_1["edad"] == 27]

  nombre  edad     ciudad
b  María    30  Barcelona

In [ ]:
#filtrado avanzado
filtro = df["edad"] > 20 
filtro &= df["Carrera"] == "Ingenieria"
res = df[filtro]

In [ ]:
#conversion de tipo de dato
df["Calificacion"] = df["Calificacion"].astype(float)
df["edad"] = pd.to_numeric(df["Edad"])